<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'Имя',
    'column.guard_name' => 'Название охранника',
    'column.roles' => 'Роли',
    'column.permissions' => 'Разрешения',
    'column.updated_at' => 'Обновлено',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'Имя',
    'field.guard_name' => 'Название охранника',
    'field.permissions' => 'Разрешения',
    'field.select_all.name' => 'Выбрать все',
    'field.select_all.message' => 'Включить все разрешения, которые в данный момент <span class="text-primary font-medium">Включены</span> для этой роли',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'Администрирование',
    'nav.role.label' => 'Роли',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Роль',
    'resource.label.roles' => 'Роли',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Сущности',
    'resources' => 'Ресурсы',
    'widgets' => 'Виджеты',
    'pages' => 'Страницы',
    'custom' => 'Пользовательские разрешения',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'У вас нет разрешения для доступа',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'Просмотр',
        'view_any' => 'Просмотреть все',
        'create' => 'Создать',
        'update' => 'Обновить',
        'delete' => 'Удалить',
        'delete_any' => 'Удалить все',
        'force_delete' => 'Принудительное удаление',
        'force_delete_any' => 'Принудительно удалить все',
        'restore' => 'Восстановить',
        'reorder' => 'Изменить порядок',
        'restore_any' => 'Восстановить все',
        'replicate' => 'Копировать',
    ],
];
